In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('weather_data.csv')

In [3]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

# Read excel

In [4]:
df=pd.read_excel('weather_data.xlsx')

In [5]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

# Write DF to CSV

In [6]:
df.to_csv('new.csv')

In [7]:
df.to_csv('new_noIndex.csv',index=False)

# Data store to excel->

In [8]:
df.to_excel('new.xlsx',sheet_name='weather_data')

In [9]:
df=pd.read_excel('new.xlsx')

In [10]:
df

   Unnamed: 0       day  temperature  windspeed  event
0           0  1/1/2017           32          6   Rain
1           1  1/2/2017           35          7  Sunny
2           2  1/3/2017           28          2   Snow
3           3  1/4/2017           24          7   Snow
4           4  1/5/2017           32          4   Rain
5           5  1/6/2017           31          2  Sunny

# Group BY

In [11]:
import pandas as pd

In [12]:
df=pd.read_csv('weather_data_cities.csv')
df

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [13]:
g=df.groupby('city')

In [14]:
g

In [15]:
for city,city_df in g:
    print(city)
    print(city_df)

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

# To get the specific group

In [17]:
g.get_group('new york')

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny

# Find maximum temparature in each of cities

In [18]:
print(g.max())

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [19]:
print(g.mean())

          temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
paris           47.75      12.75

In [20]:
print(g.describe())

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

# Concatenate data frames

In [21]:
import pandas as pd

In [23]:
india_weather=pd.DataFrame({
    "city":["Mumbai","delhi","bangalore"],
    "temparature":[32,45,30],
    "humidity":[80,60,78]
})
india_weather

        city  temparature  humidity
0     Mumbai           32        80
1      delhi           45        60
2  bangalore           30        78

In [24]:
us_weather=pd.DataFrame({
    "city":["newyork","chicago","orlando"],
    "temparature":[21,14,35],
    "humidity":[68,65,75]
})
us_weather

      city  temparature  humidity
0  newyork           21        68
1  chicago           14        65
2  orlando           35        75

# concatenate two dataframes

In [25]:
df=pd.concat([india_weather,us_weather])
df

        city  temparature  humidity
0     Mumbai           32        80
1      delhi           45        60
2  bangalore           30        78
0    newyork           21        68
1    chicago           14        65
2    orlando           35        75

# If you want contineous index

In [26]:
df=pd.concat([india_weather,us_weather],ignore_index=True)

In [27]:
df

        city  temparature  humidity
0     Mumbai           32        80
1      delhi           45        60
2  bangalore           30        78
3    newyork           21        68
4    chicago           14        65
5    orlando           35        75

# Rowwise concatenate

In [28]:
df=pd.concat([india_weather,us_weather],axis=1)

In [29]:
df

        city  temparature  humidity     city  temparature  humidity
0     Mumbai           32        80  newyork           21        68
1      delhi           45        60  chicago           14        65
2  bangalore           30        78  orlando           35        75

# Merge DataFrames

In [33]:
temparature_df=pd.DataFrame({"city":["Mumbai","delhi","bangalore","hyderbad"],
                           "temparature":[32,45,30,40]})
temparature_df

        city  temparature
0     Mumbai           32
1      delhi           45
2  bangalore           30
3   hyderbad           40

In [34]:
humidity_df=pd.DataFrame({"city":["delhi","mumbai","bangalore"],
                         "humidity":[68,65,75]})
humidity_df

        city  humidity
0      delhi        68
1     mumbai        65
2  bangalore        75

# Merge two dataframes with our explicitly mentioned index

In [37]:
df=pd.merge(temparature_df,humidity_df,on='city') # Join in SQL
df

        city  temparature  humidity
0      delhi           45        68
1  bangalore           30        75

In [35]:
df=pd.merge(temparature_df,humidity_df,on='city',how='outer') #Outer Join

In [36]:
df

        city  temparature  humidity
0     Mumbai         32.0       NaN
1      delhi         45.0      68.0
2  bangalore         30.0      75.0
3   hyderbad         40.0       NaN
4     mumbai          NaN      65.0

# Numerical indexing

Row number is the default index

In [40]:
df=pd.DataFrame([1,2,3,4,5,6,7,8,9],index=[49,48,47,46,45,1,2,3,4])
df

    0
49  1
48  2
47  3
46  4
45  5
1   6
2   7
3   8
4   9

In [45]:
df.loc[46] # index to access data

0    4
Name: 46, dtype: int64

In [44]:
df.iloc[3] #row number

0    4
Name: 46, dtype: int64

In [46]:
df.loc[45]

0    5
Name: 45, dtype: int64

In [47]:
df.iloc[45]

IndexError: single positional indexer is out-of-bounds

In [50]:
df.loc[:2] # upto 2 number index

    0
49  1
48  2
47  3
46  4
45  5
1   6
2   7

In [52]:
df.iloc[:2]

    0
49  1
48  2